IDENTIFICATION DIVISION.
PROGRAM-ID. MainProgram.

ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 EMPLOYEE-ID   PIC 9(5) VALUE 12345.
01 SALARY        PIC ZZZZ9.99 VALUE 2500.75.
01 ERROR-CODE    PIC 9(1).

PROCEDURE DIVISION.
    CALL "SubProgram" USING EMPLOYEE-ID SALARY ERROR-CODE.
    DISPLAY "Exit code " ERROR-CODE.
    STOP RUN.