IDENTIFICATION DIVISION.
PROGRAM-ID. BasicMath.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM1 PIC 9(1) VALUE 3.
01 NUM2 PIC 9(1) VALUE 5.
01 RESULT PIC 9(1).

PROCEDURE DIVISION.
    COMPUTE RESULT = NUM1 * NUM2.
    DISPLAY RESULT.